configure tunnel on RA

RouterA(config)#interface tunnel 1
RouterA(config-if)#ip unnumbered Loopback0
RouterA(config-if)#tunnel destination 192.2.0.11
RouterA(config-if)#tunnel mode mpls traffic-eng
RouterA(config-if)#tunnel mpls traffic-eng bandwidth 150 !Specification of the tunnel bandwidth (Kbit/s)
RouterA(config-if)#tunnel mpls traffic-eng path-option 1 explicit name path1
RouterA(config)#interface tunnel 2
RouterA(config-if)#ip unnumbered Loopback0
RouterA(config-if)#tunnel destination 192.2.0.11
RouterA(config-if)#tunnel mode mpls traffic-eng
RouterA(config-if)#tunnel mpls traffic-eng bandwidth 150 
RouterA(config-if)#tunnel mpls traffic-eng path-option 1 explicit name path2

RouterA(config)#ip explicit-path name path1 enable
RouterA(cfg-ip-expl-path)#next-address 200.10.1.1 !Router1
RouterA(cfg-ip-expl-path)#next-address 200.1.11.11 !RouterB
RouterA(config)#ip explicit-path name path2 enable
RouterA(cfg-ip-expl-path)#next-address 200.10.2.2 !Router2
RouterA(cfg-ip-expl-path)#next-address 200.2.11.11 !RouterB
-----
configure tunnel on RB

RouterA(config)#interface tunnel 1
RouterA(config-if)#ip unnumbered Loopback0
RouterA(config-if)#tunnel destination 192.2.0.10
RouterA(config-if)#tunnel mode mpls traffic-eng
RouterA(config-if)#tunnel mpls traffic-eng bandwidth 150 !Specification of the tunnel bandwidth (Kbit/s)
RouterA(config-if)#tunnel mpls traffic-eng path-option 1 explicit name path1
RouterA(config)#interface tunnel 2
RouterA(config-if)#ip unnumbered Loopback0
RouterA(config-if)#tunnel destination 192.2.0.10
RouterA(config-if)#tunnel mode mpls traffic-eng
RouterA(config-if)#tunnel mpls traffic-eng bandwidth 150 
RouterA(config-if)#tunnel mpls traffic-eng path-option 1 explicit name path2

RouterA(config)#ip explicit-path name path1 enable
RouterA(cfg-ip-expl-path)#next-address 200.1.11.1 !Router1
RouterA(cfg-ip-expl-path)#next-address 200.10.1.10 !RouterA
RouterA(config)#ip explicit-path name path2 enable
RouterA(cfg-ip-expl-path)#next-address 200.2.11.2 !Router2
RouterA(cfg-ip-expl-path)#next-address 200.10.2.10 !RouterA
-----

Setup dynamic tunnel

Router RA
RouterA(config)#interface tunnel 3
RouterA(config-if)#ip unnumbered Loopback0
RouterA(config-if)#tunnel destination 192.2.0.11
RouterA(config-if)#tunnel mode mpls traffic-eng
RouterA(config-if)#tunnel mpls traffic-eng autoroute announce
RouterA(config-if)#tunnel mpls traffic-eng bandwidth 150
RouterA(config-if)#tunnel mpls traffic-eng path-option 1 dynamic
...
RouterA(config)#interface tunnel 4
RouterA(config-if)#ip unnumbered Loopback0
RouterA(config-if)#tunnel destination 192.2.0.11
RouterA(config-if)#tunnel mode mpls traffic-eng
RouterA(config-if)#tunnel mpls traffic-eng autoroute announce
RouterA(config-if)#tunnel mpls traffic-eng auto-bw !bandwidth is automatically adjusted


Router RB
RouterB(config)#interface tunnel 3
RouterB(config-if)#ip unnumbered Loopback0
RouterB(config-if)#tunnel destination 192.2.0.10
RouterB(config-if)#tunnel mode mpls traffic-eng
RouterB(config-if)#tunnel mpls traffic-eng autoroute announce
RouterB(config-if)#tunnel mpls traffic-eng bandwidth 150
RouterB(config-if)#tunnel mpls traffic-eng path-option 1 dynamic
...
RouterB(config)#interface tunnel 4
RouterB(config-if)#ip unnumbered Loopback0
RouterB(config-if)#tunnel destination 192.2.0.10
RouterB(config-if)#tunnel mode mpls traffic-eng
RouterB(config-if)#tunnel mpls traffic-eng autoroute announce
RouterB(config-if)#tunnel mpls traffic-eng auto-bw !bandwidth is automatically adjusted
RouterB(config-if)#tunnel mpls traffic-eng path-option 1 dynamic
---------------------------------------------------------------------------------------

MPLS-VPN (with MP-BGP and VRF)

RouterA(config)#ip vrf VPN-1
RouterA(config-vrf)#rd 200:1
RouterA(config-vrf)#route-target export 200:1
RouterA(config-vrf)#route-target import 200:1
RouterA(config)#ip vrf VPN-2
RouterA(config-vrf)#rd 200:2
RouterA(config-vrf)#route-target export 200:2
RouterA(config-vrf)#route-target import 200:2
Associate each one of the network interfaces to the respective VRF instance (VPN):
RouterA(config)#interface FastEthernet0/0 
RouterA(config-if)#ip vrf forwarding VPN-1 
RouterA(config-if)#ip address 192.3.1.10 255.255.255.0 !Addresses must be re-configured
RouterA(config-if)#interface FastEthernet0/1
RouterA(config-if)#ip vrf forwarding VPN-2 
RouterA(config-if)#ip address 192.3.2.10 255.255.255.0 !Addresses must be re-configured
----
RouterB(config)#ip vrf VPN-1
RouterB(config-vrf)#rd 200:1
RouterB(config-vrf)#route-target export 200:1
RouterB(config-vrf)#route-target import 200:1
RouterB(config)#ip vrf VPN-2
RouterB(config-vrf)#rd 200:2
RouterB(config-vrf)#route-target export 200:2
RouterB(config-vrf)#route-target import 200:2
Associate each one of the network interfaces to the respective VRF instance (VPN):
RouterB(config)#interface FastEthernet0/0 
RouterB(config-if)#ip vrf forwarding VPN-1 
RouterB(config-if)#ip address 192.1.1.11 255.255.255.128 !Addresses must be re-configured
RouterB(config-if)#interface FastEthernet0/1
RouterB(config-if)#ip vrf forwarding VPN-2 
RouterB(config-if)#ip address 192.1.1.139 255.255.255.128 !Addresses must be re-configured


RouterA(config)#router bgp 200 
RouterA(config-router)#bgp router-id 10.10.10.10 !router-id must be defined
RouterA(config-router)#neighbor 192.2.0.11 remote-as 200 
RouterA(config-router)#neighbor 192.2.0.11 update-source Loopback0
RouterA(config-router)#address-family vpnv4 
RouterA(config-router-af)#neighbor 192.2.0.11 activate 
RouterA(config-router-af)#neighbor 192.2.0.11 send-community both 
RouterA(config-router)#address-family ipv4 vrf VPN-1 
RouterA(config-router-af)# redistribute connected 
RouterA(config-router)#address-family ipv4 vrf VPN-2 
RouterA(config-router-af)#redistribute connected

RouterB(config)#router bgp 200 
RouterB(config-router)#bgp router-id 11.11.11.11 !router-id must be defined
RouterB(config-router)#neighbor 192.2.0.10 remote-as 200 
RouterB(config-router)#neighbor 192.2.0.10 update-source Loopback0
RouterB(config-router)#address-family vpnv4 
RouterB(config-router-af)#neighbor 192.2.0.10 activate 
RouterB(config-router-af)#neighbor 192.2.0.10 send-community both 
RouterB(config-router)#address-family ipv4 vrf VPN-1 
RouterB(config-router-af)# redistribute connected 
RouterB(config-router)#address-family ipv4 vrf VPN-2 
RouterB(config-router-af)#redistribute connected